<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"b6732a7481ff593474f11b0a616f99b9106894f91f7f510cbaafce40eb430bcf","plan_job_ref":"Job Test actions using target and replace #469 at https://github.com/dflook/terraform-github-actions/actions/runs/14040972099","plan_out_hash":"268f6933b0da7951e9d6558f8e2f212804b8c112f3728704a825ef6a81551382","plan_hash":"375faa719bff8388fe66ca20ec97c34fe9a940ff426ce6117d063b8e5b247075","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "KjvXRAhpo4" -> (known after apply)
!~  foreach = "0knLSKUhmC" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #469](https://github.com/dflook/terraform-github-actions/actions/runs/14040972099)